---
kind: property
id: P:Autodesk.Revit.DB.BasePoint.IsShared
source: html/c4beb95c-34c9-0a9c-05a0-562bd0c98b81.htm
---
# Autodesk.Revit.DB.BasePoint.IsShared Property

Indicates whether the BasePoint is shared. The project's survey point
 is a BasePoint which is shared.

## Syntax (C#)
```csharp
public bool IsShared { get; }
```